In [42]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [43]:
num_stu = len(student_data)
pass_math = (sum(student_data["math_score"] >=70) / num_stu) * 100
pass_read = (sum(student_data["reading_score"] >=70) / num_stu) * 100
stu_pass = ((len(student_data.loc[(student_data['math_score']>=70) & (student_data['reading_score']>= 70)])) / num_stu) * 100

dist_sumry = [
    {"Total Schools":len(school_data), 
     "Total Students":num_stu, 
     "Total Budget":sum(school_data["budget"]), 
     "Average Math Score":student_data["math_score"].mean(),
     "Average Reading Score":student_data["reading_score"].mean(),
     "% Passing Math":pass_math, 
     "% Passing Reading":pass_read, 
     "% Overall Passing":stu_pass}]
dist_sumry_df = pd.DataFrame(dist_sumry)
pd.options.display.float_format = "{:,.6f}".format
dist_sumry_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.877840,74.980853,85.805463,65.172326

In [33]:
# rename columns to spec, albeit probably too early
schl_sumry_df = school_data.rename(columns={'school_name':'School Name','type':'School Type', 'size':'Total Students','budget':'Total School Budget'})
schl_sumry_df.head()

,School ID,School Name,School Type,Total Students,Total School Budget
0,0,Huang High School,District,2917,1910635
1,1,Figueroa High School,District,2949,1884411
2,2,Shelton High School,Charter,1761,1056600
3,3,Hernandez High School,District,4635,3022020
4,4,Griffin High School,Charter,1468,917500

In [34]:
# Calc per stu budget
budget_per = schl_sumry_df['Total School Budget'] / schl_sumry_df['Total Students']
budget_per

0    655.000000
1    639.000000
2    600.000000
3    652.000000
4    625.000000
5    578.000000
6    582.000000
7    628.000000
8    581.000000
9    609.000000
10   583.000000
11   637.000000
12   650.000000
13   644.000000
14   638.000000
dtype: float64

In [35]:
# Assign per stu budget
schl_sumry_df["Per Student Budget"] = budget_per
schl_sumry_df.head()

,School ID,School Name,School Type,Total Students,Total School Budget,Per Student Budget
0,0,Huang High School,District,2917,1910635,655.000000
1,1,Figueroa High School,District,2949,1884411,639.000000
2,2,Shelton High School,Charter,1761,1056600,600.000000
3,3,Hernandez High School,District,4635,3022020,652.000000
4,4,Griffin High School,Charter,1468,917500,625.000000

In [36]:
avg_math =  school_data_complete.groupby('school_name',as_index=False)['math_score'].mean()
schl_sumry_df['Average Math Score'] = avg_math['math_score']

avg_read = school_data_complete.groupby('school_name',as_index=False)['reading_score'].mean()
schl_sumry_df['Average Reading Score'] = avg_read['reading_score']  

# pass_math = (sum(student_data["math_score"].count() ## >=70) / num_stu) * 100
pct_math = school_data_complete.groupby('school_name',as_index=False)['math_score'].count() #>= 70 #/ school_data_complete['size'] * 100

math_pct = school_data_complete.groupby('school_name',as_index=False)['math_score'].count() / ['size']
math_pct

,School ID,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score
0,0,Huang High School,District,2917,1910635,655.000000,77.048432,81.033963
1,1,Figueroa High School,District,2949,1884411,639.000000,83.061895,83.975780
2,2,Shelton High School,Charter,1761,1056600,600.000000,76.711767,81.158020
3,3,Hernandez High School,District,4635,3022020,652.000000,77.102592,80.746258
4,4,Griffin High School,Charter,1468,917500,625.000000,83.351499,83.816757
5,5,Wilson High School,Charter,2283,1319574,578.000000,77.289752,80.934412
6,6,Cabrera High School,Charter,1858,1081356,582.000000,83.803279,83.814988
7,7,Bailey High School,District,4976,3124928,628.000000,76.629414,81.182722
8,8,Holden High School,Charter,427,248087,581.000000,77.072464,80.966394
9,9,Pena High School,Charter,962,585858,609.000000,83.839917,84.044699
10,10,Wright High School,Charter,1800,1049400,583.000000,76.842711,80.744686
11,11,Rodriguez High School,District,3999,2547363,637.000000,83.359455,83.725724
12,12,Johnson High School,District,4761,3094650,650.000000,83.418349,83.848930
13,13,Ford High School,District,2739,1763916,644.000000,83.274201,83.989488
14,14,Thomas High School,Charter,1635,1043130,638.000000,83.682222,83.955000

In [37]:
schl_sumry_df = schl_sumry_df.rename(columns={"School Name":"school_name"})

schl_sumry_df.head()

,School ID,school_name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score
0,0,Huang High School,District,2917,1910635,655.000000,77.048432,81.033963
1,1,Figueroa High School,District,2949,1884411,639.000000,83.061895,83.975780
2,2,Shelton High School,Charter,1761,1056600,600.000000,76.711767,81.158020
3,3,Hernandez High School,District,4635,3022020,652.000000,77.102592,80.746258
4,4,Griffin High School,Charter,1468,917500,625.000000,83.351499,83.816757

In [38]:
#pct_math_df = school_data_complete['math_score'].loc[(school_data_complete['math_score'] >= 70)] 
pct_math_df = school_data_complete.loc[(school_data_complete['math_score'] >= 70)]
#pct_math_df = pct_math_df.groupby['school_name'].count() / pct_math_df['size']
pct_math_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [9]:
pct_math_result_df = pct_math_df.groupby('school_name',as_index=False)['math_score'].count() #/ schl_sumry_df['Total Students'].value_counts()
pct_math_result_df

#merge_df = pd.merge_ordered(pct_math_result_df,schl_sumry_df,on="school_name",how="right")
#merge_df['math_score'] = merge_df['math_score'] / pct_math_df.count()
#merge_df

              school_name  math_score
0      Bailey High School        3318
1     Cabrera High School        1749
2    Figueroa High School        1946
3        Ford High School        1871
4     Griffin High School        1371
5   Hernandez High School        3094
6      Holden High School         395
7       Huang High School        1916
8     Johnson High School        3145
9        Pena High School         910
10  Rodriguez High School        2654
11    Shelton High School        1653
12     Thomas High School        1525
13     Wilson High School        2143
14     Wright High School        1680